SampleSOAP_RQ_RS/OTA_AirScheduleRQ.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:tak="tflite.com/TakeFliteExternalService/" 
    xmlns:ns="http://www.opentravel.org/OTA/2003/05">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>tflite.com/TakeFliteExternalService/TakeFliteOtaService/OTA_AirScheduleRQ</wsa:Action>
        <wsa:To>https://apps8.tflite.com/PublicService/Ota.svc</wsa:To>
    </soap:Header>
    <soap:Body>
        <tak:OTA_AirScheduleRQ>
            <tak:AirScheduleRQ EchoToken="TEST">
                <ns:OriginDestinationInformation>
                    <ns:DepartureDateTime>2020-07-10</ns:DepartureDateTime>
                    <ns:OriginLocation>Wellington</ns:OriginLocation>
                </ns:OriginDestinationInformation>
            </tak:AirScheduleRQ>
            <tak:Credentials>
                <tak:AgentLogin>ShoreEx</tak:AgentLogin>
                <tak:AgentPassword>CoastalJNU8995</tak:AgentPassword>
                <tak:ServiceId>devcst</tak:ServiceId>
            </tak:Credentials>
        </tak:OTA_AirScheduleRQ>
    </soap:Body>
</soap:Envelope>